

// wallet_page.dart
// appbarの左にユーザーネームを表示する
// ユーザーネームはタップできる
// ユーザーネームをタップすると、ユーザーネームを変更するページに遷移する
// ユーザーネームを変更するページでは、ユーザーネームを変更できる
// ユーザーネームを変更するページでは、変更を保存できる
// 変更したら、popで戻る、
// 変更したら、firestoreに保存する
// 変更したら、appbarに表示されるユーザーネームも変更する
// appbarの右に設定アイコンを表示する
// 設定アイコンをタップすると、設定ページに遷移する
// appbarの背景色は濃い緑、文字色は白、フォントはロボット

// appbar以外のメインのwalletページとしてのロジック
// appbarの下に、二つのタブを表示する
// 一つ目のタブは、walletタブ、もう一つは、historyタブ
// walletタブは、グリッドビューで表示する
// historyタブは、リストビューで表示する
// walletタブのグリッドビューの中身は、firestoreから取得する
// historyタブのリストビューの中身は、firestoreから取得する
// walletタブのグリッドビューの中身は、firestoreに保存する
// historyタブのリストビューの中身は、firestoreに保存する

// グリッドビューもリストビューも、隙間はなく、アイテム同士がくっついている
// 

// 